tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "mongodb/brew"
tap "romkatv/powerlevel10k"
brew "node"
brew "angular-cli"
brew "chezmoi"
brew "csvkit"
brew "git"
brew "helm"
brew "kubernetes-cli", link: false
brew "make"
brew "mas"
brew "maven"
brew "minikube"
brew "node@16"
brew "node@14"
brew "openjdk@17"
brew "python@3.9"
brew "tldr"
brew "yarn"
brew "zsh-autosuggestions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "mongodb/brew/mongodb-community"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "azure-data-studio"
cask "chromedriver"
cask "docker"
cask "google-drive"
cask "iterm2"
cask "lens"
cask "mactex"
cask "microsoft-remote-desktop"
cask "plex"
cask "postgres"
cask "postman"
cask "rectangle"
cask "spotify"
cask "steam"
cask "unity"
cask "unity-hub"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
mas "HP Smart", id: 1474276998
vscode "Angular.ng-template"
vscode "ckolkman.vscode-postgres"
vscode "dbaeumer.vscode-eslint"
vscode "DotJoshJohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "James-Yu.latex-workshop"
vscode "jbockle.jbockle-format-files"
vscode "jeff-hykin.better-perl-syntax"
vscode "mathematic.vscode-latex"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "richterger.perl"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sfodje.perltidy"
vscode "SonarSource.sonarlint-vscode"
vscode "stylelint.vscode-stylelint"
vscode "TabNine.tabnine-vscode"
vscode "taniarascia.new-moon-vscode"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "vincaslt.highlight-matching-tag"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vmware.vscode-boot-dev-pack"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
vscode "vscode-infra.image-viewer"
